[![env0](https://app.env0.com/images/vcs-comment-banner.png)](https://env0.com)
🚀&nbsp; env0 had composed a PR Plan for environment [EC2_S3_infra_Demo / env0_poc ](https://app.env0.com/p/d5dacbab-06d8-4927-8b76-bd1236751572/environments/6c22bcfc-199e-481d-bac6-943de8feb5f3?organizationId=1a96ff13-f1c3-498d-ae70-67a19d3c63eb):
```
Plan: 3 to add, 0 to change, 3 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:


  # aws_s3_bucket.thiss3 must be replaced
-/+ resource "aws_s3_bucket" "thiss3" {
+       acceleration_status         = (known after apply)
+       acl                         = (known after apply)
!       arn                         = "arn:aws:s3:::dev-us-east-1-warrior-0751raj" -> (known after apply)
!       bucket                      = "dev-us-east-1-warrior-0751raj" -> "dev-us-east-1-warrior-0751raj-warrior" # forces replacement
!       bucket_domain_name          = "dev-us-east-1-warrior-0751raj.s3.amazonaws.com" -> (known after apply)
+       bucket_prefix               = (known after apply)
!       bucket_regional_domain_name = "dev-us-east-1-warrior-0751raj.s3.us-east-1.amazonaws.com" -> (known after apply)
!       hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
!       id                          = "dev-us-east-1-warrior-0751raj" -> (known after apply)
!       object_lock_enabled         = false -> (known after apply)
+       policy                      = (known after apply)
!       region                      = "us-east-1" -> (known after apply)
!       request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "dev"
            "Managed_by"  = "Terraform"
            "Name"        = "warrior-0751raj-warrior-00756"
        }
+       website_domain              = (known after apply)
+       website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

-       grant {
-           id          = "4c0812c31d67778730bcbb1611394358bb060a67ce040f0e6c7bd35aacba0b89" -> null
-           permissions = [
-               "FULL_CONTROL",
            ] -> null
-           type        = "CanonicalUser" -> null
        }

-       server_side_encryption_configuration {
-           rule {
-               bucket_key_enabled = false -> null

-               apply_server_side_encryption_by_default {
-                   sse_algorithm = "AES256" -> null
                }
            }
        }

-       versioning {
-           enabled    = true -> null
-           mfa_delete = false -> null
        }
    }

  # aws_s3_bucket_public_access_block.block_public_access_data must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "block_public_access_data" {
!       bucket                  = "dev-us-east-1-warrior-0751raj" # forces replacement -> (known after apply) # forces replacement
!       id                      = "dev-us-east-1-warrior-0751raj" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket_versioning.s3_data_bucket_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "s3_data_bucket_versioning" {
!       bucket = "dev-us-east-1-warrior-0751raj" # forces replacement -> (known after apply) # forces replacement
!       id     = "dev-us-east-1-warrior-0751raj" -> (known after apply)

!       versioning_configuration {
+           mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
!   s3_bucket_arn                        = "arn:aws:s3:::dev-us-east-1-warrior-0751raj" -> (known after apply)
!   s3_bucket_name                       = "dev-us-east-1-warrior-0751raj" -> "dev-us-east-1-warrior-0751raj-warrior"
```
</details>


```
Failed to calculate cost estimation
```


[Full PR Plan logs on env0](https://app.env0.com/p/d5dacbab-06d8-4927-8b76-bd1236751572/environments/6c22bcfc-199e-481d-bac6-943de8feb5f3/deployments/7bff6949-40e0-40cb-b078-8a44314701a1?organizationId=1a96ff13-f1c3-498d-ae70-67a19d3c63eb)
